app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (title like '%%' or director like '%%')

  def create
        @movie = Movie.new(movie_params)

        if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "release_date", "remote_image_url", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "poster_image_url" = ?, "remote_image_url" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["poster_image_url", "Aang.png"], ["remote_image_url", ""], ["updated_at", Tue, 21 Jul 2015 23:17:52 UTC +00:00]]